# SketchDimensionsRemoved Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..SketchDimensionsRemoved Property
BuiltInFailures..::..RebarFailures Class See Also
---
The sketch dimensions, that were used to create the sketch, have been removed from the completed rebar shape definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SketchDimensionsRemoved { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchDimensionsRemoved As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SketchDimensionsRemoved {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace